In [1]:
import pandas as pd

In [2]:
# Let's create a dataframe

record1 = pd.Series({'Name' : 'Alen',
                     'Class' : '6th',
                     'Subject' : 'Physics',
                     'Mark' : 98})
record2 = pd.Series({'Name' : 'Akil',
                    'Class' : '8th',
                    'Subject' : 'Maths',
                    'Mark' : 60})
record3 = pd.Series({'Name' : 'Manu',
                     'Class' : '10th',
                     'Subject' : 'English',
                     'Mark' : 88})

In [3]:
df = pd.DataFrame([record1, record2 , record3], index = ['School 1', 'School 2', 'School 1'])
df

          Name Class  Subject  Mark
School 1  Alen   6th  Physics    98
School 2  Akil   8th    Maths    60
School 1  Manu  10th  English    88

In [4]:
df.iloc[0]

Name          Alen
Class          6th
Subject    Physics
Mark            98
Name: School 1, dtype: object

In [5]:
type(df.loc['School 2'])

pandas.core.series.Series

In [6]:
df.loc['School 1']

          Name Class  Subject  Mark
School 1  Alen   6th  Physics    98
School 1  Manu  10th  English    88

In [7]:
type(df.loc['School 1'])

pandas.core.frame.DataFrame

In [8]:
df.loc['School 1', 'Name']

School 1    Alen
School 1    Manu
Name: Name, dtype: object

What if we need get column values?

transpose the data frame and retrieve values.

In [9]:
df.T

        School 1 School 2 School 1
Name        Alen     Akil     Manu
Class        6th      8th     10th
Subject  Physics    Maths  English
Mark          98       60       88

In [10]:
df.T.loc['Name']

School 1    Alen
School 2    Akil
School 1    Manu
Name: Name, dtype: object

OR

In [11]:
df['Name']

School 1    Alen
School 2    Akil
School 1    Manu
Name: Name, dtype: object

Because `.iloc` and `.loc` are for row selection

In [12]:
df.loc['School 1']['Name'] # not recommended

School 1    Alen
School 1    Manu
Name: Name, dtype: object

In [13]:
df.loc[:,['Name','Subject']]

          Name  Subject
School 1  Alen  Physics
School 2  Akil    Maths
School 1  Manu  English

In [14]:
df.loc[:,['Name','Subject']].T

        School 1 School 2 School 1
Name        Alen     Akil     Manu
Subject  Physics    Maths  English

Rows and Columns are our understanding purpose, actually it's two dimensions of a array.

#### Delete Data from dataframe

In [15]:
df.drop('School 1')

          Name Class Subject  Mark
School 2  Akil   8th   Maths    60

In [16]:
df # drop methord dosn't change the actuall data frame.

          Name Class  Subject  Mark
School 1  Alen   6th  Physics    98
School 2  Akil   8th    Maths    60
School 1  Manu  10th  English    88

but we can change the actuall data frame by adding `inplace=True` argument

In [17]:
# lets make a copy of df

copy_df = df.copy()
copy_df

          Name Class  Subject  Mark
School 1  Alen   6th  Physics    98
School 2  Akil   8th    Maths    60
School 1  Manu  10th  English    88

In [18]:
copy_df.drop('Name', inplace=True, axis=1)

In [19]:
copy1_df = df.copy()
copy1_df.drop('School 2', inplace=True, axis=0)
print(copy1_df)

          Name Class  Subject  Mark
School 1  Alen   6th  Physics    98
School 1  Manu  10th  English    88

In [20]:
copy_df

         Class  Subject  Mark
School 1   6th  Physics    98
School 2   8th    Maths    60
School 1  10th  English    88

Another way to do this `del`

In [21]:
del copy_df['Mark']
copy_df

         Class  Subject
School 1   6th  Physics
School 2   8th    Maths
School 1  10th  English

add new column into df

In [22]:
df['CGPA'] = ['9.8','6','88']
df

          Name Class  Subject  Mark CGPA
School 1  Alen   6th  Physics    98  9.8
School 2  Akil   8th    Maths    60    6
School 1  Manu  10th  English    88   88

In [23]:
# add new row

School_3 = pd.DataFrame([{'Name' : 'Babu',
                          'Class' : '11th',
                          'Subject' : 'Chimistry',
                          'Mark' : 90,
                          'CGPA' : 9}], index = ['School 3'])
new_df = pd.concat([df,School_3])
new_df

          Name Class    Subject  Mark CGPA
School 1  Alen   6th    Physics    98  9.8
School 2  Akil   8th      Maths    60    6
School 1  Manu  10th    English    88   88
School 3  Babu  11th  Chimistry    90    9

In [24]:
# easy way

School_3 = ['Babu','11th','Chimestry','90','9']
df.loc[len(df)] = School_3
df.index.values[3] = 'School 3'
df

# not recommended , because slow.

          Name Class    Subject Mark CGPA
School 1  Alen   6th    Physics   98  9.8
School 2  Akil   8th      Maths   60    6
School 1  Manu  10th    English   88   88
School 3  Babu  11th  Chimestry   90    9